app/controllers/api/v1/greeting_controller.rb

      def index
        @greeting = Greeting.all.shuffle
---
SELECT "greetings".* FROM "greetings"